FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_SSP.c
static void ISSPOutput(T_LPC1768_SSP_Workspace *aW)
{
    T_LPC1768_SSP_Registers *p = aW->iReg;
    SPI_Request *r = aW->iRequest;
    TUInt32 num;
    TUInt8 *p_dataMOSI8;

    // Is there any room to send data?
    num = r->iNumTransfers - r->iNumTransferredOut;
    if (r->iDataMOSI) {
        // Output bytes from the array
        if (num >= 4) {
            p_dataMOSI8 = ((TUInt8 *)r->iDataMOSI) + r->iNumTransferredOut;
            p->iDR = p_dataMOSI8[0];
            p->iDR = p_dataMOSI8[1];
            p->iDR = p_dataMOSI8[2];
            p->iDR = p_dataMOSI8[3];
            r->iNumTransferredOut+=4;
        } else if (num) {
            // Output all we got left
            p_dataMOSI8 = ((TUInt8 *)r->iDataMOSI) + r->iNumTransferredOut;
            while (num--) {
                p->iDR = *(p_dataMOSI8++);
                r->iNumTransferredOut++;
            }
        } else {
            // No longer report interrupts for room to transfer,
            // we are out of bytes to transfer.
            p->iIMSC &= ~(SSP_TXIM);
        }
    } else {
        // Output 0xFF's
        if (num >= 4) {
            // Output 4 in a bunch
            p->iDR = 0xFF;
            p->iDR = 0xFF;
            p->iDR = 0xFF;
            p->iDR = 0xFF;
            r->iNumTransferredOut += 4;
        } else if (num) {
            // Output the remaining
            while (num--) {
                p->iDR = 0xFF;
                r->iNumTransferredOut++;
            }
        } else {
            // There is no more to output, stop doing interrupts
            // from the TXIM
            p->iIMSC &= ~(SSP_TXIM);
        }
    }
}

static T_uezError LPC1768_SSP_TransferNoBlock(
        void *aWorkspace,
        SPI_Request *aRequest,
        T_spiCompleteCallback aCallback,
        void *aCallbackWorkspace)
{
    T_LPC1768_SSP_Workspace *aW = (T_LPC1768_SSP_Workspace *)aWorkspace;
    T_LPC1768_SSP_Registers *p = aW->iReg;

    // This routine only works with transfer of 8 bits or lower
    if (aRequest->iBitsPerTransfer > 8)
        return UEZ_ERROR_INVALID_PARAMETER;

    aRequest->iNumTransferredOut = 0;
    aRequest->iNumTransferredIn = 0;

    // Setup the callback and the parameters
    aW->iCompleteCallback = aCallback;
    aW->iCompleteCallbackWorkspace = aCallbackWorkspace;
    aW->iRequest = aRequest;

    // Setup SSP for this configuration
    ISSPConfig(aW, aRequest);

    // Start SSP
    ISSPStart(aRequest);

    // Note we are in the middle of a transaction
    aW->iIsBusy = ETrue;

    // Allow receive half full, receive idle, and transmit half empty interrupts
    p->iIMSC = SSP_RTIM|SSP_RXIM|SSP_TXIM;

    // Prime the pump and output in an amount of data
    // On interrupting, we'll feed in the data
    ISSPOutput(aW);

    // Now allow processing of the interrupts (which probably just occurred)
    InterruptEnable(aW->iIRQChannel);

    return UEZ_ERROR_NONE;
}

static TBool LPC1768_SSP_IsBusy(void *aWorkspace)
{
    T_LPC1768_SSP_Workspace *aW = (T_LPC1768_SSP_Workspace *)aWorkspace;

    return aW->iIsBusy;
}




/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_SPI SSP_LPC1768_Port0_Interface = {
    {
    "NXP:LPC1768:SSP0",
    0x0100,
    LPC1768_SSP_SSP0_InitializeWorkspace,
    sizeof(T_LPC1768_SSP_Workspace),
    },

    LPC1768_SSP_TransferPolled,

    LPC1768_SSP_Start,
        LPC1768_SSP_TransferInOut,
        LPC1768_SSP_Stop,
        LPC1768_SSP_TransferInOutBytes,

        // uEZ v2.02
        LPC1768_SSP_TransferNoBlock,
        LPC1768_SSP_IsBusy,
};

const HAL_SPI SSP_LPC1768_Port1_Interface = {
    {
    "NXP:LPC1768:SSP1",
    0x0100,
    LPC1768_SSP_SSP1_InitializeWorkspace,
    sizeof(T_LPC1768_SSP_Workspace),
    },

    LPC1768_SSP_TransferPolled,


        LPC1768_SSP_Start,
        LPC1768_SSP_TransferInOut,
        LPC1768_SSP_Stop,
        LPC1768_SSP_TransferInOutBytes,

        // uEZ v2.02
        LPC1768_SSP_TransferNoBlock,
        LPC1768_SSP_IsBusy,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1768_SSP0_Require(
        T_uezGPIOPortPin aPinSCK0,
        T_uezGPIOPortPin aPinMISO0,
        T_uezGPIOPortPin aPinMOSI0,
        T_uezGPIOPortPin aPinSSEL0)
{
    static const T_LPC1768_IOCON_ConfigList sck0[] = {
            {GPIO_P0_15, IOCON_D_DEFAULT(2)},
            {GPIO_P1_20, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC1768_IOCON_ConfigList ssel0[] = {
            {GPIO_P0_16, IOCON_D_DEFAULT(2)},
            {GPIO_P1_21, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC1768_IOCON_ConfigList miso0[] = {
            {GPIO_P0_17, IOCON_D_DEFAULT(2)},
            {GPIO_P1_23, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC1768_IOCON_ConfigList mosi0[] = {
            {GPIO_P0_18, IOCON_D_DEFAULT(2)},
            {GPIO_P1_24, IOCON_D_DEFAULT(3)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register SSP0
    HALInterfaceRegister("SSP0",
            (T_halInterface *)&SSP_LPC1768_Port0_Interface, 0, 0);
    LPC1768_IOCON_ConfigPinOrNone(aPinSCK0, sck0, ARRAY_COUNT(sck0));
    LPC1768_IOCON_ConfigPinOrNone(aPinSSEL0, ssel0, ARRAY_COUNT(ssel0));
    LPC1768_IOCON_ConfigPinOrNone(aPinMISO0, miso0, ARRAY_COUNT(miso0));
    LPC1768_IOCON_ConfigPinOrNone(aPinMOSI0, mosi0, ARRAY_COUNT(mosi0));
    LPC1768PowerOn(1<<21);

    // Setup interrupt, but do not enable
    InterruptRegister(SSP0_IRQn, ISSP0IRQ, INTERRUPT_PRIORITY_HIGH, "SSP0");
    InterruptDisable(SSP0_IRQn);
}

void LPC1768_SSP1_Require(
        T_uezGPIOPortPin aPinSCK1,
        T_uezGPIOPortPin aPinMISO1,
        T_uezGPIOPortPin aPinMOSI1,
        T_uezGPIOPortPin aPinSSEL1)
{
    static const T_LPC1768_IOCON_ConfigList sck1[] = {
            {GPIO_P0_7,  IOCON_D_DEFAULT(2)},
            {GPIO_P1_31, IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1768_IOCON_ConfigList ssel1[] = {
            {GPIO_P0_6,  IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1768_IOCON_ConfigList miso1[] = {
            {GPIO_P0_8,  IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1768_IOCON_ConfigList mosi1[] = {
            {GPIO_P0_9,  IOCON_D_DEFAULT(2)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register SSP1
    HALInterfaceRegister("SSP1",
            (T_halInterface *)&SSP_LPC1768_Port1_Interface, 0, 0);
    LPC1768_IOCON_ConfigPinOrNone(aPinSCK1, sck1, ARRAY_COUNT(sck1));
    LPC1768_IOCON_ConfigPinOrNone(aPinSSEL1, ssel1, ARRAY_COUNT(ssel1));
    LPC1768_IOCON_ConfigPinOrNone(aPinMISO1, miso1, ARRAY_COUNT(miso1));
    LPC1768_IOCON_ConfigPinOrNone(aPinMOSI1, mosi1, ARRAY_COUNT(mosi1));
    LPC1768PowerOn(1<<10);

    // Setup interrupt, but do not enable
    InterruptRegister(SSP1_IRQn, ISSP1IRQ, INTERRUPT_PRIORITY_HIGH, "SSP1");
    InterruptDisable(SSP1_IRQn);
}

/*-------------------------------------------------------------------------*
 * End of File:  SSP.c
 *-------------------------------------------------------------------------*/

